.. _abn_userguide:

Australian Business Numbers
===========================

Introduction
------------

The function :func:`clean_au_abn() <dataprep.clean.clean_au_abn.clean_au_abn>` cleans a column containing Australian Business Number (ABN) strings, and standardizes them in a given format. The function :func:`validate_au_abn() <dataprep.clean.clean_au_abn.validate_au_abn>` validates either a single ABN strings, a column of ABN strings or a DataFrame of ABN strings, returning `True` if the value is valid, and `False` otherwise.

ABN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "51824753556"
* `standard`: ABN strings with proper whitespace in the proper places, like "51 824 753 556"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_au_abn()` and `validate_au_abn()`.

### An example dataset containing ABN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "abn": [
            "83 914 571 673",
            "99 999 999 999",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              abn                                           address
0  83 914 571 673                                     123 Pine Ave.
1  99 999 999 999                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_au_abn`

By default, `clean_au_abn` will clean abn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_au_abn
clean_au_abn(df, column = "abn")

,abn,address,abn_clean
0,83 914 571 673,123 Pine Ave.,83 914 571 673
1,99 999 999 999,main st,NaN
2,51824753556,1234 west main heights 57033,51 824 753 556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_au_abn(df, column = "abn", output_format="standard")

,abn,address,abn_clean
0,83 914 571 673,123 Pine Ave.,83 914 571 673
1,99 999 999 999,main st,NaN
2,51824753556,1234 west main heights 57033,51 824 753 556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_au_abn(df, column = "abn", output_format="compact")

,abn,address,abn_clean
0,83 914 571 673,123 Pine Ave.,83914571673
1,99 999 999 999,main st,NaN
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51824753556
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned ABN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_au_abn(df, column="abn", inplace=True)

        abn_clean                                           address
0  83 914 571 673                                     123 Pine Ave.
1             NaN                                           main st
2  51 824 753 556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4             NaN                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6             NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_au_abn(df, "abn", errors="coerce")

,abn,address,abn_clean
0,83 914 571 673,123 Pine Ave.,83 914 571 673
1,99 999 999 999,main st,NaN
2,51824753556,1234 west main heights 57033,51 824 753 556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_au_abn(df, "abn", errors="ignore")

,abn,address,abn_clean
0,83 914 571 673,123 Pine Ave.,83 914 571 673
1,99 999 999 999,main st,99 999 999 999
2,51824753556,1234 west main heights 57033,51 824 753 556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_au_abn()`

`validate_au_abn()` returns `True` when the input is a valid ABN. Otherwise it returns `False`.

The input of `validate_au_abn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_au_abn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_au_abn()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_au_abn
print(validate_au_abn("83 914 571 673"))
print(validate_au_abn("99 999 999 999"))
print(validate_au_abn("51824753556"))
print(validate_au_abn("51 824 753 556"))
print(validate_au_abn("hello"))
print(validate_au_abn(np.nan))
print(validate_au_abn("NULL"))

True
False
True
True
False
False
False

### Series

In [9]:
validate_au_abn(df["abn"])

0     True
1    False
2     True
3     True
4    False
5    False
6    False
Name: abn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_au_abn(df, column="abn")

0     True
1    False
2     True
3     True
4    False
5    False
6    False
Name: abn, dtype: bool

### Only DataFrame

In [11]:
validate_au_abn(df)

     abn  address
0   True    False
1  False    False
2   True    False
3   True    False
4  False    False
5  False    False
6  False    False